Revit 2027 API
Plane.XVec Property
 Axis defining the first parametric direction of the plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ XVec { get; }
Public ReadOnly Property XVec As XYZ
	Get
public:
property XYZ^ XVec {
	XYZ^ get ();
}
member XVec : XYZ with get
Property Value
XYZ
See Also
Reference
Plane Class
Autodesk.Revit.DB Namespace